app/controllers/building_types_controller.rb

  def show
    @building_type = BuildingType.find(params[:id])
---
SELECT * FROM "building_types" WHERE ("building_types"."id" = 980190962)

  def destroy
    @building_type = BuildingType.find(params[:id])
---
SELECT * FROM "building_types" WHERE ("building_types"."id" = 980190962)