app/controllers/flashcard_controller.rb

SELECT * FROM "words" WHERE ("words"."id" = 24)
SELECT * FROM "flashcards" WHERE ("flashcards".user_id = 1)
---
  def answer
    @last_answer = Word.find params[:answer_id]
    @last_flashcard = Flashcard.find params[:question_id]

SELECT * FROM "flashcards" WHERE ("flashcards".user_id = 2)
---
  def rate_difficulty
    flashcard = Flashcard.find params[:flashcard_id]