app/controllers/village_controller.rb

  def create
    @village = @user.build_village params[:village]
    if @village.save
---
INSERT INTO "villages" ("name", "created_at", "ration_level", "updated_at", "population", "user_id") VALUES('Will', '2010-01-31 22:24:14', 'normal', '2010-01-31 22:24:14', 1, 7)